import Head from "next/head";
import MetaTag from "@/components/MetaTag";
import React, { useEffect, useState } from "react";
import { useRouter } from "next/router";
import Link from "next/link";
import ArrowIcon from "@/components/icons/ArrowIcon";
import ButtonContact from "@/components/ButtonContact";

export default function Novel() {
  const router = useRouter();
  const { anime } = router.query;
  const delayCount = anime === "false" ? 0 : 50;
  const Mark = "\n\t";
  const Opening = `ท่ามกลางบรรยากาศที่มืดครึ้มและปกคลุมไปด้วยเมฆสีดำทมิฬที่ไม่มีแม้แสงลอดผ่าน แม้จะเป็นช่วงที่ใกล้จะแปดโมงเต็มที่แล้ว แต่บรรยากาศก็แทบไม่ต่างจากต้อนกลางคืนเท่าไหร่ ผมนั่งอยู่ที่ม้านั่งตัวหนึ่ง ภายใต้ศาลาหลังเล็กที่ตั้งโดดอยู่เพียงตัวเดียวในระแวก มีต้นไม้ใหญ่สองสามต้นปกคลุมไว้ เป็นสถานที่ๆ เงียบสงบและแทบไม่มีผู้คนเดินผ่าน 
  ${Mark}จะว่าผมคอยใครอยู่หรือไม่ คงไม่ใช่ ไม่ใช่อีกแล้วในตอนนี้ แต่หากเป็นเมื่อก่อนละก็ ผมคงจะนั่งรอใครสักคนอยู่ตรงนี้ นั่งรอเธอคนที่ชอบกินเครื่องในเป็นชีวิตจิตใจ เธอคนที่ชอบหัวเราะให้กับเรื่องไม่เป็นเรื่อง เธอคนที่มักจะยิ้มแย้มอยู่เสมอ เธอคนนั้นชอบมานั่งเล่นที่ศาลานี้อยู่เป็นประจำด้วยเหตุผลที่ว่าเงียบสงบดี 
  ${Mark}คงเพราะอยากเจอเธออีกสักครั้งผมจึงมานั่งอยู่ตรงนี้ แต่หากพูดตามสถานการความเป็นจริงแล้วคงจะไม่มีทางเกิดขึ้นได้อีก เป็นเรื่องจริงที่ว่าผมจะไม่มีทางได้เจอเธอ เหตุผลจริงๆ ที่ผมมานั่งอยู่ที่นี่อาจจะเป็นเพียงเพราะว่ามันเงียบสงบดี 
  ${Mark}ลมค่อยๆ พัดแรงขึ้นทุกที พร้อมๆ กับเสียงใบไม้สั่นไหวดังลั่นไปทั่ว เป็นบรรยากาศที่หากเป็นคนอื่นละก็คงจะกลับบ้านไปแล้ว แต่ผมก็ยังคงนั่งอยู่ต่อไป หากเป็นเธอคงอดไม่ได้แน่ๆ ที่จะบ่นเรื่องสภาพอากาศในตอนนี้ เคยทักท้วงออกไปว่าเธอน่าจะไม่ชอบถดูฝน แต่ตอนนั้นเธอก็กล่าวปฏิเสธออกมาทันที เธอดูจะเป็นคนที่เข้าใจยากจริงๆ 
  ${Mark}สักพักฝนก็ค่อยๆ โปรยปรายลงมา พร้อมกับเสียงของเม็ดฝนตกกระทบกับต้นไม้และพื้นดินเกิดเสียงดังสนั่นหวั่นไหว ละอองฝนเม็ดเล็กเม็ดน้อยลอยฟุ้งไปทั่วทั้งบริเวณ บรรยากาศที่เย็นอยู่แล้วกลับเย็นลงอีกอย่างฉับพลัน จนรู้สึกเหมือนตัวจะกลายเป็นน้ำแข็งเข้าจริงๆ หากเธอนั่งอยู่ด้วยในตอนนี้คงจะแสดงท่าทีชอบใจเอามากๆ แต่ไม่ใช่เพราะว่าเธอชอบฤดูฝนหรอก จริงๆ เธอเคยบ่นว่าฤดูฝนเดินทางไปไหนมาไหนลำบากเสียด้วยซ้ำ ก็คงจะจริงสำหรับเธอที่ชอบเดินทางไปไหนมาไหน แต่สำหรับผมที่แทบไม่ได้ออกไปไหนเลยคงจะไม่เป็นปัญหา
  ${Mark}เหตุผลจริงๆ ที่เธอแสดงท่าทีชอบใจออกมานั้นเพราะว่าเธอชอบบรรยากาศของถดูหนาว ผมเคยเดาไปว่าที่เธอชอบเพราะเดินทางไปไหนมาไหนสะดวก ไม่มีฝน แถมอากาศก็ไม่ร้อน แต่เธอก็บอกว่าไม่ใช่แบบนั้น พอถามเรื่องเหตุผลก็ได้คำตอบไม่เป็นชิ้นเป็นอัน โดยเธอตอบว่า "แค่รู้สึกชอบเป็นพิเศษน่ะ" เพียงแค่นั้น
  ${Mark}ฝนที่ตกแรงมากๆ มักจะตกเพียงไม่นาน แต่ก็ใช้เวลาอยู่นานสองนานกว่าฝนจะเริ่มลดกำลังลงและหยุดตกในที่สุด เหลือไว้แต่เพียงความเปียกชื้นที่อยู่ตามต้นไม้ ใบไม้ และพื้นดิน ที่พอเป็นหลักฐานว่าฝนเคยตกเพียงเท่านั้น
  ${Mark}พระอาทิตย์เริ่มเผยตัวออกมาให้เห็น พร้อมกับแสงแดดอ่อนๆ สาดส่องตกกระทบหยาดน้ำ ส่องแสงเป็นประกายระยิบระยับไปทั่วบริเวณ นกตัวเล็กค่อยๆ ส่งเสียงและโผลบินขึ้นไปบนท้องฟ้า ชั่วขณะเดียวกันที่น้ำตาของผมค่อยๆ ไหลรินออกมา นำพาความโศกเศร้ามายังศาลาเล็กๆ หลังนี้
           
  `;
  const [showing, setShowing] = useState("");
  const [point, setPoint] = useState(0);

  useEffect(() => {
    if (point < Opening.length) {
      setTimeout(() => {
        setShowing(showing + Opening[point]);
        setPoint(point + 1);
      }, delayCount);
    }
  }, [showing]);
  return (
    <>
      <Head>
        <MetaTag
          title="Arikato111"
          description="เว็บไซต์สำหรับการแนะนำตัว ช่องทางการติดต่อ และเก็บผลงานการเขียนเว็บไซต์ต่างๆ"
          image="https://arikato111.vercel.app/example-page.png"
          url="https://arikato111.vercel.app"
        />
        <title>novel</title>
      </Head>
      <main className="main bg-yellow-100/40">
        <div className="inline-block">
          <Link href="/">
            <ButtonContact Class="bg-pink-300 hover:scale-100 hover:bg-pink-300/90 hover:shadow-pink-100 border-pink-100" Icon={ArrowIcon} title="back" />
          </Link>
        </div>

        <div className="pt-10 p-3">
          <pre className="whitespace-pre-wrap px-5 sm:px-20 sm:text-lg dark:text-slate-200">
            <h3>บทที่ 1 สายฝน</h3>
            {Mark}
            {showing}
          </pre>
        </div>
      </main>
    </>
  );
}
